'''โปรเจคที่ 4: สมุดบันทึกรายรับ-รายจ่าย (Expense Tracker)
เป้าหมาย: เริ่มซับซ้อนขึ้น คล้าย POS แต่เน้นการดูย้อนหลัง
ฟังก์ชัน: ลงบันทึก (วันที่, รายการ, จำนวนเงิน) -> ดูประวัติย้อนหลัง -> สรุปยอดรวมทั้งหมดจากไฟล์
สกิลที่ได้: การจัดการ String ขั้นสูง (จัดการวันที่), การอ่านไฟล์มาคำนวณผลรวม'''

import os
import datetime

# ตั้งค่า path file 
script_dir = os.path.dirname(__file__)
filename = os.path.join(script_dir, 'expenses.txt')

# สร้าง function บันทึกรายการใช้จ่าย
def add_transation():
    print('\n--- 💰 บันทึกรายรับ รายจ่าย ---')
    desc = input('รายการ รับ-จ่าย: ')

    # เช็กก่อนว่าเป็นตัวเลขหรือไม่
    amount_str = input('จำนวนเงิน: ')
    if not amount_str.isdigit():
        print('ใส่ตัวเลขเท่านั้นครับ')
        return
    
    # ถ้าเป็นตัวเลข ให้แปลงเป็น int
    amount = int(amount_str)

    # ถามผู้ใช้ว่าเป็นรายรับหรือรายจ่าย
    print('ประเภท: [1] รายรับ 🟢 [2] รายจ่าย 🔴')
    Type = input('เลือก: ')

    if Type == '2':
        amount = amount * -1    # แปลงเป็นค่าติดลบ
    elif Type != '1':
        print('❌ เลือกผิด ยกเลิกรายการ')
        return
    
    # หาวันที่ปัจจุุบัน
    date_now = datetime.datetime.now().strftime('%Y-%m-%d')

    with open(filename, 'a', encoding='utf-8') as f:
        f.write(f'{date_now},{desc},{amount}\n')

    print(' บันทึกเรียบร้อย!')

    

