'''🧠 Logic การคำนวณ (Business Logic)
เพื่อให้สมจริง (แบบย่อ) เราจะใช้กติกานี้ครับ:
ประกันสังคม (SSO): หัก 5% ของเงินเดือน (แต่สูงสุดไม่เกิน 750 บาท)
ภาษี (Tax): คิดแบบขั้นบันไดง่ายๆ
เงินเดือนไม่เกิน 20,000 = ไม่เสียภาษี
เกิน 20,000 = หัก 3%
เกิน 50,000 = หัก 5% (คนรวยจ่ายเยอะหน่อย)
เงินสุทธิ (Net Salary): เงินเดือน - ประกันสังคม - ภาษี'''

import os


script_dir = os.path.dirname(__file__)
filename = os.path.join(script_dir, 'employees.txt')

def load_employees():
    '''อ่านข้อมูลพนักงาน: รหัส, ชื่อ, เงินเดือน, ตำแหน่ง'''
    employees = []
    if os.path.exists(filename):
        with open(filename, encoding='utf-8') as f:
            for line in f:
                parts = line.strip().split(',')
                employees.append(parts)
    return employees

def save_employees(employees:list):
    '''บันทึกข้อมูลใน list เข้าไปเก็บไว้ใน file'''
    with open(filename, 'w', encoding='utf-8') as f:
        for item in employees:
            line = ','.join(item)
            f.write(line + '\n')
    print('💾 บันทึกข้อเรียบร้อย!')

def add_employee(employees:list):
    print('\n --- ➕ เพิ่มพนักงานใหม่ ---')
    emp_id = input('รหัสพนักงาน (EMP01): ').strip().upper()

    for item in employees:
        if item[0] == emp_id:
            print('❌ รหัสนี้มีอยู่แล้ว')
            return

    name = input('ชื่อ-นามสกุล: ').strip()

    while True:
        sarary_str = input('เงินเดือน (บาท): ').strip()
        if sarary_str.isdigit():
            break
        print('❌ ใส่ตัวเลขเท่านั้นครับ!')
    
    position = input('ตำแหน่งงาน: ').strip()

    # เก็บ List (salary เก็บเป็น str ไปก่อนเพือนให้ save ง่าย)
    employees.append([emp_id, name, sarary_str, position])
    save_employees(employees)
    print(f'✅ ยินดีต้อนรับคุณ {name} สู่ทีม')

def delete_employee(employees:list):
    print('\n---🗑️ ลบข้อมูลพนักงาน ---')
    target_id = input('ป้อนรหัสพนักงานที่จะลบ: ').strip().upper()

    found = False
    for item in employees:
        if item[0] == target_id:
            print(f'เจอคุณ: {item[1]} (ตำแหน่ง: {item[3]})')
            confirm = input('ยืนยันการลาออก (y/n): ').lower()
            if confirm == 'y':
                employees.remove(item)
                found = True
                print('✅ ลบเรียบร้อย')
                break
            else:
                return
    
    if found:
        save_employees(employees)
    else:
        print('❌ ไม่พบรหัสนี้')

def show_all_employees(employees:list):
    print('\n' + '='*70)
    print(f"{'ID':<8} {'ชื่อ-สกุล':<25} {'ตำแหน่ง':<15} {'เงินเดือน':10}")
    print('='*70)
    for item in employees:
        salary_fmt = f"{int(item[2]):,}"
        print(f"{item[0]:<8} {item[1]:<25} {item[3]} {salary_fmt:>10}")
    print('='*70)

def calculate_and_show_slip(employees:list):
    '''function คำนวณเงินเดือน (สลิป)'''
    print('\n--- 💸 ออกสลิปเงินเดือน ---')
    target_id = input('ป้อนรหัสพนักงาน: ').strip().upper()

    found = False
    for item in employees:
        if item[0] == target_id:
            found = True
            name = item[1]
            salary = int(item[2])   # แปลงเป็นตัวเลขเพื่อคำนวณ
            position = item[3]

            # --- 🧠 Logic การคำนวณ ---

            # 1. ประกันสังคน 5% (สูงสุดไม่เกิน 750)
            sso = salary * 0.05
            if sso > 750:
                sso = 750
            
            # 2. ภาษี (Step Tax)
            tax = 0
            if salary > 50000:
                tax = salary * 0.05     # 5%
            elif salary > 20000:
                tax = salary * 0.03     # 3%
            else:
                tax = 0 # ฟรี
            
            # 3. เงินสุุทธิ
            net_salary = salary - sso - tax

            # --- แสดงผลสลิปแบบมืออาชีพ ---
            print('\n' + '*'*40)
            print(f'📄 SLIP เงินเดือน: {name} ({position})')
            print('*'*40)
            print(f'💵 เงินเดือนพื้นฐาน: {salary:>10,} บาท')
            print(f'➖ หักประกันสังคม: {sso:>10,.2f} บาท')
            print(f'➖ หักภาษี ณ ที่จ่าย: {tax:>10,.2f} บาท')
            print('-' * 40)
            print(f'💰 เงินรับสุทธิ: {net_salary:>10,.2f} บาท')
            print('-' * 40)
            break

    if not found:
        print('❌ ไม่พบพนักงานรหัสนี้')

