'''Project 8: สมุดโทรศัพท์ (Contact Book)
เป้าหมาย: สร้างสมุดโทรศัพท์ที่เก็บ ชื่อ, เบอร์โทร, อีเมล และแยกการทำงานเป็นสัดส่วน'''

import os

# 
script_dir = os.path.dirname(__file__)
filename = os.path.join(script_dir, 'contract.txt')

def load_contracts():
    '''อ่านรายชื่อทั้งหมดจากไฟล์'''
    contract = []
    if os.path.exists(filename):
        with open(filename, encoding='utf-8') as f:
            for line in f:
                # รูปแบบ: ชื่อ,เบอร์โทร,อีเมล
                parts = line.strip().split(',')
                # เช็คก่อนว่าตรงตามรูปแบบไหม
                if len(parts) == 3:
                    contract.append(parts)
    return contract

def save_contracts(contracts:list):
    '''บันทึกข้อมูลทับลงไฟล์'''
    with open(filename, 'w', encoding='utf-8') as f:
        for item in contracts:
            line = ','.join(item)
            f.write(line + '\n')
    print('💾 บันทึกข้อมูลเรียบร้อย!')

def show_all_contracts(contracts:list):
    '''แสดงรายชื่อแบบตาราง'''
    print('\n' + '='*60)
    print(f"{'No.':<4} {'ชื่อ':<25} {'เบอร์โทร':<15} {'อีเมล':<20}")
    print('='*60)

    if not contracts:
        print(" (สมุดโทรศัพท์ว่างเปล่า)")
    else:
        for i, item in enumerate(contracts):
            # i=No. item[0]=ชื่อ, item[1]=เบอร์โทร, item[2]=email
            print(f'{i+1:<4} {item[0]:<23} {item[1]:<15} {item[2]:<20}')
            print('='*60)

def add_contract(contracts:list):
    '''เพิ่มรายชื่อใหม่'''
    print('\n--- ➕ เพิ่มรายชื่อใหม่ ---')
    name = input('ชื่อ-นามสกุล: ').strip()

    # เช็คว่าชื่อว่างไหม
    if not name:
        print('ใส่ชื่อด้วยครับ!')
        return

    for item in contracts:
        if item[0] == name:
            print(f'❌ ชื่อ {name} มีอยู่แล้วครับ')
            return

    phone = input('เบอร์โทร: ').strip()
    email = input('อีเมล (ถ้าไม่มีกด Enter): ').strip()

    # ถ้าไม่มีอีเมล ให้ใส่ - แทน
    if not email:
        email = '-'

    # เพิ่มลง list และ save
    contracts.append([name, phone, email])
    save_contracts(contracts)
    print(f'✅ บันทึกคุณ {name} เรียบร้อย!')


def delete_contract(contracts:list):
    '''ลบรายชื่อ'''
    target_contract = input('ป้อนชื่อที่ต้องการลบ: ').strip()

    found = False

    # วันลูปหาชื่อที่จะลบ
    for item in contracts:
        if item[0] == target_contract:
            print(f'เจอรายชื่อ {item[0]} เบอร์โทร {item[1]} ที่จะลบ')

            confirm = input('ยืนยันการลบไหม? (y/n): ').strip().lower()

            if confirm == 'y':
                contracts.remove(item)
                found = True
                print('✅ ลบเรียบร้อยแล้ว!')
                break
            else:
                print('ยกเลิกการลบครับ')
                return
    if found:
        save_contracts(contracts)
    else:
        print('❌ ไม่พบรายชื่อนี้ครับ')

def update_contract(contracts:list):
    '''def แก้ไข ชื่อ เบอร์โทร อีเมล'''
    while True:
        data_contracts = load_contracts()
        print('\n--- 🔧 แก้ไขข้อมูลรายชื่อ ---')
        print('[N] แก้ไขชื่อ')
        print('[P] แก้ไขเบอร์โทร')
        print('[E] แก้ไขอีเมล')
        print('[Q] ออกจากการแก้ไข')
        
        choice = input('เลือกคำสั่ง: ').strip().upper()

        if choice == 'N':
            edit_name_contract(data_contracts)
        elif choice == "P":
            pass
        elif choice == 'E':
            pass
        elif choice == 'Q':
            print('ออกจากการแก้ไขข้อมูลรายชื่อ')
            return
        else:
            print('เลือกคำสั่งไม่ถูกต้อง!')    


def edit_name_contract(contracts:list):
    print('--- แก้ไขชื่อ ---')
    target_name = input('ชื่อที่ต้องการแก้ไข: ')

    found = False

    for item in contracts:
        if item[0] == target_name:
            print(f'เจอแล้ว ชื่อปัจจุบัน {item[0]}')
            new_name = input('ป้อนชื่อที่ต้องการเปลี่ยน: ').strip()
            item[0] = new_name
            found = True
            print('✅ เปลี่ยนชื่อเรียบร้อย')
            break
    # เช็คว่าหาเจอหรือไม่
    if found:
        save_contracts(contracts)
    else:
        print('❌ ไม่พบชื่อนี้ในระบบครับ!')
