'''📦 Project 9: ระบบสต็อกสินค้า (Mini Inventory)
ความยากที่เพิ่มขึ้น:
การคำนวณเลข: โปรเจคนี้ไม่ใช่แค่แก้ข้อความ (String) แต่ต้องมีการ บวก/ลบ จำนวนสินค้า (Integer)
Logic การเบิกของ: ต้องเช็คว่า "ของพอให้เบิกไหม?" (ติดลบไม่ได้)
มูลค่ารวม: ต้องคำนวณ จำนวน x ราคา เพื่อดูมูลค่าของในโกดัง'''

# รหัสสินค้า,ชื่อสินค้า,จำนวน,ราคา

import os

script_dir = os.path.dirname(__file__)
filename = os.path.join(script_dir, 'stock.txt')

def load_products():
    '''อ่านสินค้าที่มีในไฟล์ทั้งหมด'''
    products = []
    if os.path.exists(filename):
        with open(filename, encoding='utf-8') as f:
            for line in f:
                parts = line.strip().split(',')
                if len(parts) == 4:
                    products.append(parts)
    return products

def save_products(products:list):
    '''บันทึกลงไฟล์'''
    with open(filename, 'w', encoding='utf-8') as f:
        for item in products:
            # item คือ [รหัส, ชื่อ, จำนวน, ราคา]
            # เวลา save ต้องรวมเป็น string คั่นด้วย comma 
            line = ','.join(item)
            f.write(line + '\n')
    print('💾 บันทึกข้อมูลเรียบร้อย!')

def show_all_products(products:list):
    print('\n' + '='*60)
    print(f"{'No.':<4} {'รหัส':<10} {'ชื่อสินค้า':<20} {'จำนวน':>10} {'ราคา':>10}")
    print('='*60)

    for i, item in enumerate(products):
        # item[2] คือจำนวน, item[3] คือราคา
        # ใช้ > เพื่อจัดชิดขวาให้ตัวเลขตรงหลัก
        print(f'{str(i+1)+'.'} {item[0]:<10} {item[1]:<20} {item[2]:>10} {item[3]:>10}')
    print('='*60)

def add_product(products):
    print('\n--- ➕ เพิ่มรหัสสินค้าใหม่ ---')
    code = input('รหัสสินค้า (P01): ').strip().upper()

    # เช็คซ้ำ
    for item in products:
        if item[0] == code:
            print(f'รหัสสินค้า {item[0]} มีในระบบแล้ว')
            return
    
    name = input('ชื่อสินค้า: ').strip()

    while True:
        qty = input('จำนวนเริ่มต้น: ').strip()
        if not qty.isdigit():
            print('ป้อนจำนวนเป็นตัวเลขเท่านั้นครับ')
        break
    
    while True:
        price = input('ราคาต่อชิ้น: ').strip()
        if not price.isdigit():
            print('ป้อนราคาเป็นตัวเลขเท่านั้นครับ')
        break

    # บันทึกเป็น string ไปก่อน (เดี๋ยวตอนคำนวณค่อยแปลง)
    products.append([code, name, qty, price])
    save_products(products)
    print(f'✅ เพิ่ม {name} เข้าสต๊อกแล้ว')

