'''โปรเจคที่ 5 (Boss Level): ระบบทะเบียนคุมทรัพย์สินไอที (Mini IT Asset)
เป้าหมาย: ตรงกับงานจริงของป๋า!
ฟังก์ชัน: รับรหัสครุภัณฑ์, ชื่อ, สถานะ (ปกติ/ส่งซ่อม) -> บันทึกลงไฟล์ -> ค้นหาทรัพย์สินจากรหัส -> แก้ไขสถานะทรัพย์สิน (Update)
สกิลที่ได้: การแก้ไขข้อมูลใน List แล้วบันทึกทับกลับไปในไฟล์ (Update logic)'''

import os

scrip_dir = os.path.dirname(__file__)
filename = os.path.join(scrip_dir, 'assets.txt')

def load_assets():
    '''อ่านไฟล์แล้วคืนค่าเป็น List of Lists'''
    assets = []
    if os.path.exists(filename):
        with open(filename, encoding='utf-8') as f:
            for line in f:
                parts = line.strip().split(',')
                if len(parts) == 4:
                    assets.append(parts)
    return assets

def save_assets(assets):
    '''รับ List ทั้งหมด แล้วบันทึกทับลงไฟล์ (Mod 'w')'''
    with open(filename, 'w', encoding='utf-8') as f:
        for item in assets:
            # item คือ ['IT-001', 'Notebook', 'Laptop', 'ปกติ']
            # ต้องรวมกลับเป็น string คั่นด้วย comma
            line = ','.join(item)
            f.write(line + '\n')
    print('💾 บันทึกเรียบร้อย!')

def show_all_assets(assets):
    print('\n' + '='*60)
    print(f'{'รหัส':<10} {'ชื่ออุปกรณ์':<25} {'ประเภท':<10} {'สถานะ':<10}')
    print('='*60)

    for item in assets:
        # item[0]=รหัส, [1]=ชื่อ, [2]=ประเภท, [3]=สถานะ
        print(f'{item[0]:<10} {item[1]:<25} {item[2]:<10} {item[3]<10}')
    print('='*60)
